<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class PositionSeeder extends Seeder
{
  /**
   * Run the database seeds.
   */
  public function run(): void
  {
    //

    DB::table('positions')->insert([
      ['name' => 'Бизнес-аналитик'],
      ['name' => "Ведущий инженер"],
      ['name' => "Ведущий инженер-проектировщик АСУ ТП"],
      ['name' => "Ведущий инженер-системотехник"],
      ['name' => "Ведущий разработчик"],
      ['name' => "Генеральный директор"],
      ['name' => "Главный инженер"],
      ['name' => "Главный конструктор"],
      ['name' => "Заместитель главного конструктора"],
      ['name' => "Заместитель начальника отдела"],
      ['name' => "Инженер"],
      ['name' => "Инженер-программист"],
      ['name' => "Инженер-программист (ML-инженер)"],
      ['name' => "Инженер-проектировщик"],
      ['name' => "Инженер-проектировщик автоматизированных систем управления технологическими процессами"],
      ['name' => "Инженер-системотехник"],
      ['name' => "Инженер-теплоэнергетик"],
      ['name' => "Кладовщик"],
      ['name' => "Мастер-электромонтажник"],
      ['name' => "Менеджер по закупкам"],
      ['name' => "Младший разработчик"],
      ['name' => "Монтажник радиоэлектронной аппаратуры"],
      ['name' => "Начальник департамента"],
      ['name' => "Начальник отдела"],
      ['name' => "Офис-менеджер"],
      ['name' => "Плотник"],
      ['name' => "Помощник инженера-проектировщика автоматизированных систем управления технологическими процессами"],
      ['name' => "Программист"],
      ['name' => "Разработчик"],
      ['name' => "Руководитель обособленного подразделения"],
      ['name' => "Руководитель проекта ЕДС"],
      ['name' => "Слесарь-электромонтажник"],
      ['name' => "Тестировщик"],
      ['name' => "Технический писатель"],
      ['name' => "Уборщик служебных помещений"],
      ['name' => "Специалист по подбору персонала"],
      ['name' => "Ведущий экономист"],
      ['name' => "Аналитик данных"],
      ['name' => "Системный администратор"],
      ['name' => "Экономист"]
    ]);
  }
}
